# RevitLinkInstance Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
RevitLinkInstance Class
Members See Also
---
Represents an instance of a RevitLinkType.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public class RevitLinkInstance : Instance
```

Visual Basic
---
```text
Public Class RevitLinkInstance _
	Inherits Instance
```

Visual C++
---
```text
public ref class RevitLinkInstance : public Instance
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..Element Autodesk.Revit.DB..::..Instance Autodesk.Revit.DB..::..RevitLinkInstance
# See Also
RevitLinkInstance Members
Autodesk.Revit.DB Namespace